[
    {
        "name": "Radha-Madana-mohana",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1001,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68759,
            "latitude": 27.58023
        },
        "imageName": "1. Radha-Madana-mohana temple",
        "description": "The Radha-Madana-mohana temple, founded by Srila Sanatana Goswami, occupies a special position in Gaudiya Vaishnavism. Madana-mohana temple was attacked by Muslims during the time of Aurangzeb in around 1670. Later on, new temple was built next to the original structures. Caretakers of these Deities brought Them to Karauli for safety. Radha-Madana-mohan Mandir is \"Visiting card\" of Vrindavan. A very ancient temple was built by Sanatana Goswami. When Lord Krishna left this planet five thousand years ago His great-grandson, Vajranabha, wanted to establish shrines dedicated to Him and to install Deities therein. The first Deity to be carved was Madana-mohana. At that time, the only person still living who had directly seen Krishna was Uttara, the widowed wife of Arjuna's son, Abhimanyu, who had been killed during the Battle of Kuruksetra. Thus Vajranabha called her to be present when the murti of Madana-mohana was being made. When the carving was completed, she inspected the Deity and said: “Yes, this looks just like Krsna - up to the waist\".\r\n\r\nDuring the time of Lord Caitanya Madana-mohana was being worshiped by Srila Sanatana Gosvami. Before Lord Caitanya visited Vrindavan Advaita Acarya came there and stayed for some time. It is said that one morning local girls approached him and told about the location of the Modana-Mohan Deity. Following their instructions, he was able to find Him, and then he worshiped this Deity for some time. Before returning to Navadvipa, shortly before the arrival of Mahaprabhu, he entrusted the worship of the Deity to Chauba, the brahmana from Mathura, from whom Srila Sanatana Gosvami received Him. \r\n\r\nMadana-mohan is the Deity Who precides over the stage of Krishna consciousness known as sambandha or the establishing of one’s the forgotten relationship with the Lord. Madana-mohan means \"the attractor of Cupid\".\r\nThe understanding is that if one worships Madana-mohana very attentively, particularly in the earlier stages of devotional service, one will be protected from material desires and thus be able to become fixed in Krsna consciousness, despite being spiritually inexperienced.\r\n\r\nSamadhi of Sanatana Goswami\r\n\r\nIn 1558 on the Guru Purnima day (which normally falls on July) Srila Sanatana Goswami left this world at Manasi-ganga at Govardhana Hill. The devotees though brought his transcendental body to Vrindavana town, where it was buried immediately on the western side of the Madana-mohana temple."
    },
    {
        "name": "Radha-Govinda",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1002,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69941,
            "latitude": 27.58141
        },
        "imageName": "2. Radha-Govinda",
        "description": "Sri Govinda was originally established about 5000 years ago by the great-grandson of Lord Krishna. For a long time the Deity was considered lost. Rupa Gosvami experiencing separation sat once under a tree on the banks of the Yamuna. A handsome boy approached him and told him about the hill where cows spontaneously release their milkon the ground every day. The boy suddenly vanished and Rupa Goswami went to this place. He began to dig there and uncovered the Deity of Sri Govindaji. \r\n\r\nThe temple of Sri Radha-Govindaji was built in Vrindavan in 1590 by Maharaj Man Singh, the commander of the army of Emperor Akbar. Maharaj Man Singh was a disciple of Raghunatha Bhatta Goswami, one of the six chief gosvamis of Vrindavan. The Govindaji Temple was a magnificent seven-story mandir with an altar of marble, silver and gold. Architecturally this temple is one of the finest in North India. Several thousand people worked for five full years to complete it. Akbar himself donated red sandstone for its construction. In 1670, during the reign of Aurangzeb, the temple was plundered and destroyed. During the destruction, when there were only 3 floors left, suddenly the earth began to shake and people of Aurangzeb got scared and fled. Worship takes place in the new Govindaji Mandir (located behind the original temple). The original Govindaji is worshiped in Jaipur. On the south side there is a small temple 12 steps away from which there is a cave where the Deity of Govinda was found and where Rupa Goswami was meditating. Also there is the Deity of Yoga-maya on a lion. In addition, there is a stone slab with the imprint of Krishna. In about 1728 (some say - in 1735) Govindaji deity was brought to the city of Amber near Jaipur by Maharaj Jai Singh II for protection from Muslims. Govindaji deity is that, \"who satisfies the cows and the senses engaged in devotional service\". Govinda reveals the abhidheya-jnana to us."
    },
    {
        "name": "Radha-Gopinatha",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1003,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70005,
            "latitude": 27.58576
        },
        "imageName": "3. Radha Gopenatha in Vrindavana",
        "description": "After Uttara had Govindadeva's darshana, Vajranabha arranged for the carving of the third Deity of Krsna, Sri Gopinatha. When Uttara was called to inspect the extraordinary form, she said: \"Yes, He looks just like Krsna. Particularly His chest is just like Krishna's!\" Gopinatha is Krsna as “the master of the gopis”. Therefore He is considered the topmost form of the Lord. He presides over the stage of prayojana or the supreme goal of life, krsna-prema, pure love of Krsna. \r\n\r\nEven before the time of Lord Caitanya, as was the case for the other main Deities, Gopinatha was hidden to be saved from the ravages of the Muslim. Later on Madhu Pandit and his close friend Paramananda Bhattacharya (both disciples of Sri Gadadhara Pandita of the Pancha-tattva), while walking along the banks of the Yamuna in the Vamshivata area of Vrindavana found Him buried in the sand.\r\n\r\nThe Bhakti-ratnakara says: \"Thus Sri Madhu Pandit became the servant of Sri Gopinatha, whose bodily luster steals away the minds of everyone. Hundreds and thousands of people came running to see Him, famed personified sweetness. When the soothing sweetness and coolness of His charming form entered their hearts through their eyes, they found that the blazing fire of material existence, that had previously been burning, was now extinguished.\" (Bhakti-ratnakara, 2.478-482)\r\n\r\nIn 1589, Madhu Pandit constructed a temple for Gopinatha about one kilometer North of the Govindaji temple. There Gopinatha was worshipped until 1670, when he was taken along with Madana Mohan, Govindadeva and other important Deities of Vrindavan to Jaipur by Maharaja Jai Singh. Thereafter the original temple was damaged but later a new temple was built immediately adjacent to the old one by the same Nanda Kumar Vasu who had constructed the new Govindaji temple in Vrindavana. As one walks through the corridor toward the courtyard of the new temple the old temple is on the right.\r\n\r\nThe Deities are very unusual in the new Gopinatha temple in Vrindavana. Normally Srimati Radharani is on our right of Krsna as we look at the altar, but here Srimati Radharani is on our left of the Lord, while Her younger sister, Ananga Manjari, is on our right of him. Out of affection for Her little sister Srimati Radharani allows her to take this most privileged position so that she may render service in the most intimate ways."
    },
    {
        "name": "Radha-Damodara",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1004,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69561,
            "latitude": 27.58373
        },
        "imageName": "4. Radha-Damodara in Vrindavana",
        "description": "Radha-Damodara is a very important temple in Vrindavana. The Deity was carved by Rupa Gosvami and given as a present to his beloved disciple, Jiva Gosvami, who later built a temple here. Worship of the Deity began in 1542. In 1558 this land was purchased and the Deity was installed by nasimhasana. \r\n\r\nIn ancient times, this area was the center of Seva-kunji and the place of bhajana Rupa Gosvami. Every day, he gave lectures on the Srimad-Bhagavatam to other Gosvamis and his close disciples, and told them about Krsna's pastimes. Srila Prabhupada said that the Radha-Damodara temple is the center of the spiritual world because of the transcendental activities performed here by the followers of Lord Caitanya under the guidance of Srila Rupa Gosvami. In addition to the Deity Sri Sri Radha-Damodara, the temple contains the Deities Radha-Vrndavana Chandra Srila Krsnadasa Kaviraj, Radha-Madhava Srila Jayadeva Gosvami, Radha-Chalachikana Srila Bhurgarbha Gosvami, and Govardhana-Shila Srila Sanatana Gosvami with the footprints of Lord Krsna. \r\n\r\nSrila Rupa Gosvami's Bhajan-Kutir is located in the courtyard of the Radha-Damodara temple. This place used to be the center of Seva-kunji in ancient times, and it was the place that Rupa Gosvami made his headquarters, where he wrote many books and gave lectures on the Bhagavatam, discussing its topics with other Gosvamis and his followers. \r\n\r\nRupa Gosvami's Samadhi\r\n\r\nHere lies the sacred body of Srila Rupa Gosvami, who entered here in the year 1564. The body of Rupa Gosvami was placed in a Samadhi standing directly opposite the Bhajan-kutira of the great Saint in the courtyard of the Radha-Damodara temple by his closest and dearest disciple, Jiva Gosvami. In the year 1608, Srila Jiva Gosvami entered Samadhi and his body rests next to his favorite Deities, Radha — Damodara. The youngest of the six Gosvamis of Vrindavana, Jiva Gosvami is considered the greatest philosopher in the history of India. He was also the nephew of Rupa and Sanatana Gosvami. From 1959 to 1972, Srila Prabhupada performed many wonderful activities here, and until he left in 1977, he continued to talk about his abode in Radha-Damodar. \r\n\r\nSamadhi \r\n\r\nSrila Prabhupada brought devotees from all over the world here in 1972. He sat there, and for a month Kartika lectured on “The nectar of devotion\". The courtyard of the Sri Sri Radha Damodara temple can be seen from the window of Srila Prabhupada's kitchen. Srila Prabhupada was eating Prasad and looking out of the window at the Bhajan-Kutir and Samadhi of Srila Rupa Gosvami, meditating on his mercy."
    },
    {
        "name": "Radha-Ramana",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1005,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69873,
            "latitude": 27.58536
        },
        "imageName": "5. Radha-Ramana",
        "description": "This is the temple of Gopal Bhatta Gosvami\r\n\r\nThe Deity Radha Raman is one of the few remaining original Deities in Vrindavan, after the Muslim invasion. Gopal Bhatta Gosvami is not mentioned in the Scriptures, he asked Gosvami not to mention his name in his books. He wrote Sat Sandarbha together with Jiva Gosvami and prepared material for works of Rupa Gosvami and Sanatana Gosvami.\r\n\r\nThe Deity belongs to Gopal Bhatta Gosvami, one of the greatest Gosvamis of Vrndavana. Radha Ramana appeared very interesting. Gopal Bhatta Gosvami went to a river in the Himalayas, and when he scooped up water from that river, he had eleven shalagrams in his hand. He put them in a box. As he approached Vrndavana, Gopal Bhatta thought that he was not worthy to worship these shilas, so he returned to the Himalayas, wishing to return the shalagrams to the place from which they came. When he put them in the water, the awls crawled out of the water and crawled into his hand, telling him to worship them.\r\n\r\nGopal Bhatta went down to Vrindavan. He began writing books and worshipping 11 shalagrams.\r\n\r\nBefore the festival of Narasimha Chaturdashi, a rich merchant came to Vrndavana to donate something to the Gosvami Deities. The merchant went around all the Gosvamis distributing donations. When it came to Gopal Bhatta Gosvami's turn, the merchant asked what he needed for the Deities. But Gopal Bhatta said that he has no Deities. At this point, the gopāla Bhaṭṭa was a shame — all the Gosvami's Deity, and I have Sheila. I can't dress them up, I can't decorate them. He wanted to have a Deity, too. The next morning, when he opened the box, instead of Damodar-Shila, he saw the Deity Radha Raman.\r\n\r\nRadha Raman is a self-manifested Deity. Radha Raman is a special Deity. He is exactly up to the waist like Radha Madana Mohan, chest like Radha Govinda, and face like Radha Gopinatha. Radha Raman is a fusion of all three main Deities of Vrindavan.The name Radharaman means one who brings joy to Srimati Radharani. This is one of the innumerable names of Lord Sri Krsna.\r\n\r\nIn the temple there is no manifested Deity of Srimati Radharani, but next to Ramanaji there is Her crown, which speaks of Her presence. Every evening after 21.00 Radhu Ramana plays the flute before going to sleep. In the inner courtyard of the temple there is a place of appearance of Raja Ramana and the samadhi of Gopal Bhata Goswami."
    },
    {
        "name": "Radha-Gokulananda",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1006,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69875,
            "latitude": 27.58620
        },
        "imageName": "6. Radha-Gokulananda",
        "description": "Radha-Gokulananda Mandir is a small temple 200 meters to the left of the Radha-Ramana temple, looking at the main entrance from the road. Gokulananda, the main Deity of the temple, was installed by Srila Visvanatha Cakravarti Thakura, one of the great acaryas and commentators of Gaudiya Vaishnavism. This is a small Deity of Krishna standing alone without the manifested form of Srimati Radharani. There are also several important Deities on the altar. In the upper left corner (facing the altar) is the pratibhu form of Lord Caitanya, worshiped by Narottama das Thakura. In the center of the pratibhu there are forms of Radha-Vinoda of Lokanatha Goswami. On the right is Radha-Vijaya Govinda, the beloved masters of Baladeva Vidyabhushana. One level below on the left, is Gokulananda, and on the right is Govardhana sila of Lord Caitanya. The Caitanya-caritamrta describes how, upon returning from Vrindavan-dhama to Jagannatha Puri, a devotee named Sankarananda Sarasvati presented Lord Caitanya Govardhana with a sila along with a small garland of gunja berries. The Lord accepted these gifts with great joy and began to worship sila with great love. He brought the sila to His heart and sometimes to His eyes. \r\n\r\nSometimes He breathed in the scent of an awl and sometimes He applied It to the head. Govardhana sila was constantly bathed in the tears of the Lord's love and sometimes Lord Caitanya bathed the sila in His tears, proclaiming: “This stone is nothing but the body of Lord Krishna\". It stayed with Sri Caitanya Mahaprabhu for three years, after which He gave it to Raghunatha dasa Goswami. Raghunatha dasa Goswami worshiped this Govardhana-sila for several years, and in due time the same sila was handed over to worship Visvanatha Chakravarti Thakur. Today this shila is found in the Radha-Gokulananda temple. In the Radha-Gokulananda temple on Radha Kund you can see the pushpa-samadhi of Lokanatha Goswami and the cave in which Lokanatha performed his bhajan. The pushpa samadhi of the only disciple of Lokanatha Goswami Narottama Das Tchakura is also located here."
    },
    {
        "name": "Radha-Syamasundara",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1007,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69593,
            "latitude": 27.58258
        },
        "imageName": "7. Radha Syamasundara",
        "description": "This temple was founded by Shyamananda Pandit during his second visit to Vrindavan. The original Deity given to Srimati Radharani Syamasundara can be seen to the right of the altar. The Deity was worshipped by Shyamananda Pandit. Sometimes these Deities are called Lala-Lali (little boy and little girl). The larger Deities are called Radha-Syamasundara, and They were established by Srila Baladeva Vidyabhushana. Shyamasundara was given to Shyamananda Prabhu by Srimati Radharani in 1578 during the famous Seva Kunja game. It is said that the Deity Srimati Radharani beside Him is a self-manifested Deity given to Shyamananda Prabhu in 1580 by the Maharaja of Bharatpur. On the arrival of Srimati Radharani, on the day of Vasanta Panchami, the marriage ceremony of the Divine Couple was performed. The Sri Sri Radha Shyamsundara temple has found a special place for itself in the hearts of all Vaishnavas because it houses the most beautiful and unique Deity Sri Shyamsundar, who manifested from the heart of Srimati Radharani. All the prominent acaryas of the Gaudiya Vashnavism visited this divine Temple to get darshan of His Lordship — Sri Shyamsundar. During the daily darsana of this transcendental deity, Srila Jiva Gosvami, Sri Gopala Bhatta Gosvami, Srila Loknath Gosvami, and Sri Bhugarbha Gosvami, and many others, usually went deep into the ocean of ecstasy. Srila Raghunath das Gosvami and Srila Krsna das Kaviraja Gosvami, who usually never left Sri Radha Kundu, also visited Vrindavan for Sri Shyamsundar's darshan, despite their old age and physical problems."
    },
    {
        "name": "Krsna-Balaram Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1008,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.67740,
            "latitude": 27.57226
        },
        "imageName": "8. Krsna-Balarama",
        "description": "Sri Krsna-Balaram Mandir is a temple of the International Society for Krishna Consciousness in the Holy pilgrimage site of Vrindavana. It was built in 1975 on the initiative of the Founder of ISKCON Bhaktivedanta Swami Prabhupada. The Balarama Krishna temple is a complex of three temples. One is dedicated to Sri Gaura Nitai, the second to Krishna and Balarama, and the last to Sri Radha and Her friends, the gopis. Numerous celebrations based on the events of Krishna's life take place at the shrines. Many foreigners from all over the world come here to explore the beauty and history of this temple. For ISKCON devotees, the day of the Appearance of Lord Ramachandra, Rama-Navami is also notable for the fact that on this day, April 20, in 1975, His divine Grace A.C. Bhaktivedanta Swami Prabhupada inaugurated the Krishna Balaram Mandir in Vrindavan. In Vrindavana, the transcendental body of His Divine Grace A. C. Bhaktivedanta Swami Prabhupada, the Founder-Acarya of ISKCON, rests in a magnificent, hand-carved Samadhi of pure white marble. The Samadhi Mandir is located opposite the main temple. Srila Prabhupada entered Samadhi on the evening of November 14 1977 in the auspicious month of Kartika, surrounded by his beloved disciples who chanted the Holy names of Lord Krsna."
    },
    {
        "name": "Krishna-Balaram tree",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1009,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.67552,
            "latitude": 27.57460
        },
        "imageName": "9. Krsna-Balarama Tree",
        "description": "The Krishna-Balaram tree is on the parikrama path about a kilometer to the north of the Krishna-Balarama temple. It was actually two trees, which had intertwined with each other. The black tree represents Krishna and the white tree Balarama, although unfortunately in recent years the white tree has died. \r\n\r\nIn the Vrajavasi dialect the black tree is known as Chokra, and in Sanskrit as Sami Vriksa. Its wood has the mystical quality of producing fire when pieces are rubbed together, and therefore it has traditionally been used in the process of fire sacrifice. The beans from this tree are sweet and edible, and are sometimes referred to as Vraja chocolate! The white tree was a pipal tree which is famous as a sacred banyan tree, known in Sanskrit as asvattha. The area here is known as Raman-reti, or “pleasing sands”, and Krishna and Balarama would regularly have sporting pastimes with Their cowherd boyfriends here, while the cows relaxed in the peaceful surroundings."
    },
    {
        "name": "Varaha Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1010,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.67522,
            "latitude": 27.57613
        },
        "imageName": "10 and 12. The altar at the Varaha Temple",
        "description": "One might wonder why this place so far from the Yamuna is referred to as a ghaoa or bathing place, but 50 years ago the Yamuna flowed past here until it was dammed further upstream. In the course of His pastimes with the gopies here Lord Kanea once manifested the form of Varaha, the boar incarnation who killed the demon Hiranyaksa, the brother of Hiranyakasipu. There is a very nice Deity of Lord Varaha in the temple."
    },
    {
        "name": "Varaha Ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1012,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.67522,
            "latitude": 27.5761
        },
        "imageName": "10 and 12. The altar at the Varaha Temple",
        "description": "In the course of His pastimes with the gopis here, Lord Krsna once manifested the form of Varaha, the boar incarnation who killed the demon Hiranyaksa, the brother of Hiranyakasipu. There is a temple here with a very beautiful Deity of Lord Varaha inside of the altar room."
    },
    {
        "name": "Mohana Ter-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1013,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.67644,
            "latitude": 27.57687
        },
        "imageName": "13. Mohana Ter-ghata",
        "description": "While Lord Krsna was dancing with the gopis in the rasa dance, Kamadeva, or Cupid, was watching on and became angry. He thought to himself, Who does this young man think he is? He thinks he can dance with all these beautiful young girls and not be affected by lusty desires? I'll show him!\r\n\r\nCupid then tried to fire his arrows, which arouse sexual desire, at Krsna, but the Lord was dancing so quickly that Cupid was unable to aim properly. Each time Cupid would try to focus more intently on Krsna, he would see Him and note how beautiful He was. But then Krsna would move and Cupid would have to aim again. As he focused again and again on the Lord’s incredible threefold-bending form, he became more and more astonished by His beauty until finally he became overwhelmed and collapsed on the ground, dropping his famous bow and arrows.\r\n\r\nIt is because of this pastime that Krsna is known as Madana-mohana the attractor of Cupid."
    },
    {
        "name": "Kaliya-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1014,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68467,
            "latitude": 27.57834
        },
        "imageName": "14. The Deities at Kallya-ghata",
        "description": "Lord Krisnna jumped into waves of the Yamuna river exactly off this large Kadamba tree, to punish the serpent Kaliya for poisoning the waters of the river. \r\n\r\nThe Kadamba tree which Krsna jumped off is still there, although the Yamuna has already changed its course and does not flow near the tree except the rainy seasons when its level rises. Lord Krsna knew that a huge and venomous serpent had taken refuge in the Yamuna river, and details of this pastimes can be found in Srimad Bhagavatam, Canto 10, Chapter 16."
    },
    {
        "name": "Prabodhananda Sarasvati’s Samadhi",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1015,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68478,
            "latitude": 27.57805
        },
        "imageName": "15. Prabodhananda Sarasvati's samadhi",
        "description": "Prabodhananda Sarasvati became a follower of Sri Caitanya and was considered one of the great acaryas in the Gaudiya Vaisnava sampradaya. In fact, he is one of the greatest constant companions of the Lord. When the Lord appeared in his original form of Sri Krsna, Prabodhananda Sarasvati was one of the main gopis. This is stated in the Gaura-ganoddesa-Dipika (163) of Kavi Karnapura. \"The gopi Tungavidya, who appeared at Vrajabhumi in the course of Lord Krsna's pastimes, also appeared during the pastimes of Lord Caitanya Mahaprabhu. This time she came as Prabodhananda Swami, who became famous as Saraswati thanks to his eloquent prayers of Lord Caitanya Mahaprabhu glories.\"\r\n\r\nPrabodhananda Sarasvati is also mentioned in the introduction to Hari-bhakti-vilasa (1.2) by Srila Sanatana Gosvami. He is the author of \"Caitanya-candramrta\", \"Vrndavana-mahi mamrita\", \"Radharasa-sudhanidhi\" and several other works."
    },
    {
        "name": "Davanala-kunda",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1016,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68597,
            "latitude": 27.57052
        },
        "imageName": "16. Davanala-kunda",
        "description": "This is the place, where\r\nLord Krsna swallowed one of the forest fires,\r\nas described in the tenth Canto of the Srimad\r\nBhagavatam, Chapter 17.\r\n\r\nAfter Lord Krsna subdued the Kaliya serpent, He and the Vrajavasis came here in the late afternoon to take rest, rather than go all the way home the same day. Some were feeling drained after that very dramatic pastime, while others were feeling so many ecstatic symptoms like crying, shivering of  the body and fainting that they felt might lose control on the way back."
    },
    {
        "name": "Visrama-kunda",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1017,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.410732,
            "latitude": 27.342119
        },
        "imageName": "17. Visrama-kunda",
        "description": "Visrama-Kunda means \"Kunda where they took rest\". To get here one takes the road immediately opposite Fogla asrama and walks till the last private entrance way on the right before the end of the road. This entrance leads into a big asrama, and the kunda is located all the way through the asrama at the far end."
    },
    {
        "name": "Jaipur Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1018,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.413211,
            "latitude": 27.341974
        },
        "imageName": "18. Jaipur Temple",
        "description": "This temple was built in 1917 by the King of Jaipur, Sawai Madhav Singh, who also built the Jaipur temple at Varsana. It is a big temple and is very nicely built, with beautiful stone and marble work. On the altar are Radha-Madhava, Ananda-Bihari, and Hamsa-Gopala a Deity who is usually worshiped in all major Nimbark temples. The King was a follower of the Nimbark-sampradaya at the time."
    },
    {
        "name": "Taras Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1019,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69299,
            "latitude": 27.57014
        },
        "imageName": "19. Taras Temple",
        "description": "This very unusual temple is situated not far from the Jaipur temple. Inside, there are Radha-Krsna Deities on the altar, and in front of Them is a hookah, a pipe typically used in India by village men for smoking different types of substances. One may ask how could this pipe possibly be connected with Srimati Radharani and Lord Krsna? The answer to this question, and an extraordinary story about why and how it happened, you can find out in the book written by Bhakti Chaitanya Swami \"Vrindavan, the place of the Lord's pastimes\""
    },
    {
        "name": "Kaliya Mardana Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1020,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68566,
            "latitude": 27.57850
        },
        "imageName": "20. Kaliya Mardana Temple",
        "description": "This temple is dedicated to Lord Krsna’s subduing the Kaliya serpent, and there is a nice Deity of Srimati Radharani and Lord Krsna dancing on Kaliya’s heads.  Radha and Krsna are at the bottom, and two heads of the Kaliya serpent are above Them. This is said to be one of the original five thousand year old Deities of Vrndavana, installed by the Lord’s great-grandson, Vajranabha."
    },
    {
        "name": "Gopala-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1021,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 88.38846,
            "latitude": 23.42082
        },
        "imageName": "21. Gopala-ghata. Radha Madan-gopala at Advaita Vata",
        "description": "When Lord Krsna had subdued the serpent Kaliya, His father, Nanda Maharaja, was so overwhelmed with loving ecstasy that He gave many cows away in charity here."
    },
    {
        "name": "Advaita Vata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1024,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68850,
            "latitude": 27.58067
        },
        "imageName": "24. The entrance at Advaita Vata",
        "description": "Before Lord Caitanya visited Vrndavana, Advaita acarya came and spent some time here. It is said that He was approached by local ladies one morning, who told Him of the whereabouts of the Madana-mohana Deity,  and following their directions, He managed to locate Madana-mohana. Advaita acarya worshipped this Deity for some time.  When He was leaving to return to Navadvipa shortly before the advent of Mahaprabhu, He entrusted the worship of the Deity to Chaube, the Mathura brahmana from whom Srila Sanatana Gosvami received Him."
    },
    {
        "name": "Asta-sakhi Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1025,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68887,
            "latitude": 27.58021
        },
        "imageName": "25. Asta-sakhi Temple",
        "description": "The Ashta Sakhi temple used to be a small building on top of the hill next to Dvadashaditya-tila, which was built by a Bengali king around the end of the 19 th century. Recently, however, the temple was acquired by some devotees from Bombay, and they have replaced the former structure with a large, opulent two-storied building that has very nice facilities. On the altar are Radha and Krishna and Their eight main girlfriends, the ashta-sakhis."
    },
    {
        "name": "Bankebihari Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1026,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69050,
            "latitude": 27.57995
        },
        "imageName": "26. Bankebihari Temple",
        "description": "This historic temple and the ISKCON Krsna Balarama Temple are arguably the most popular places of worship in Vrindavana. The program of Deity worship here is extraordinary. Bankebihari means He Who Enjoys His Pastimes in the Forests. He is a Deity of Krishna on His own who was discovered in Nidhuvan on the eastern side of Vrindavana town by Swami Haridasa, a contemporary of the six Gosvamis. Some say He is a combined form of Radha and Krsna. The pujaris have a practice of opening and closing the curtains in front of Bankebihari every minute or so. The story goes that when Haridasa found Bankebihari, he would keep Him in his hut, and from time to time go out to do madhukari, which is begging for food. Bankebihari would become anxious when Haridasa would leave Him, and would sometimes run out of the hut and try to locate him. In order to avoid the possibility of Bankebihari running away and becoming lost, Haridasa was forced to stay in the hut practically the whole time, and when he did have to go out, Haridasa would close the curtain in front of the Deity’s altar. Nowadays the pujaris are afraid that if Bankebihari gets the opportunity He may go running out of the temple looking for Haridasa again, so they don’t leave the curtains open for more than a minute or so at a time."
    },
    {
        "name": "Radha-Vallabha Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1027,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69173,
            "latitude": 27.58104
        },
        "imageName": "27. Radha-Vallabha Temple",
        "description": "Radha-Vallabha is another popular Deity of Vrndavana. He was initially worshipped by Hit Harivamsa, who is regarded within the Gaudiya tradition as a disciple of Gopala Bhatta Gosvami, although he apparently claimed to have been initiated by  Srimati Radharani Herself. It is said that he installed the Deity in 1535. He established his own line known as the Radha-Vallabha line, in which devotion to Srimati Radharani is emphasized over service to Krsna.\r\nThe original temple was destroyed in 1670, and the current temple was built next door to it. Radha-Vallabha is a very beautiful Deity of Krsna standing on His own. Srimati Radharani is not manifest to our vision, but Her clothes and other paraphernalia are kept next to Krsna for Her."
    },
    {
        "name": "Nrsimhadeva Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1028,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69245,
            "latitude": 27.58101
        },
        "imageName": "28. Lord Nrsimhadeva",
        "description": "This is the largest Deity of Lord Nrsimhadeva in the city of Vrindavan. To His right is Lakshmi Devi, and to his left is Prahlada Maharaja. The pujaris say that this is a very powerful Deity, and when questioned, they say that on the empty land opposite the temple there was a house of some people who had offended the Lord in the past and lost everything as a result. All their homes were destroyed, and the land has remained empty since then."
    },
    {
        "name": "Yugala-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1029,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69108,
            "latitude": 27.58149
        },
        "imageName": "29. Bhattaji Temple",
        "description": "This is one of the favorite bathing places of Lord Krsna and Srimati Radharani, and is therefore named Yugala-ghata, or the ghata of the Divine Couple."
    },
    
    
    {
        "name": "Imli Tala",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1032,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69415,
            "latitude": 27.58349
        },
        "imageName": "32. Imli Tala",
        "description": "Imli Tala means “Tamarind Tree”. At this place, overlooking the Yamuna River, there is a tamarind tree under which Lord Krsna would sometimes sit. Five hundred years ago, Lord Caitanya regularly came to this very place, and this same tree was still there. He would sit under it, and, in the mood of Srimati Radharani, feeling great separation from Krsna chanted the holy name of the Lord. The original tree, the one Lord Krsna and Lord Caitanya sat under, has recently passed away, but before it died, the devotees here took a branch from it and planted it at the feet of the old tree. The newer tree is now growing strongly, while the body of the old tree is still standing there."
    },
    {
        "name": "Seva-kunja and Kisori-kunja",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1033,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69509,
            "latitude": 27.58245
        },
        "imageName": "33. Kisori-kunja and Seva-kunja",
        "description": "These two groves are essentially one, but somehow a wall was placed in the middle to separate them. Seva-kunja is entered from the eastern side, near Imli Tala, whereas Kisori-kunja is entered from Loi Bazaar near the Post Office and Heera Jewelers. Seva-kunja means “the grove where service was rendered,” and it is understood to be in the middle of the place where the rasa dance happened, as described in the Tenth Canto of Srimad-Bhagavatam. It is understood that the whole area inside the parikrama path around Vrndavana town was originally Seva-kunja, although the name is now ascribed to this small garden in the center of the town. Here Lord Krsna rendered intimate service to Srimati Radharani by massaging and decorating Her lotus feet when She became fatigued during the rasa dance pastime. There is a small temple on the far side of Seva-kunja named Ranga Mahal where this is said to have happened. On the altar, there is a nice picture of the pastime, showing Krsna massaging Srimati Radharani’s right knee. There is also a kunja nearer to the entrance named Lalita-kunja which is said to have been dug by the Lord with His flute. It is here that Lalita devi dipped Dukhi Krsnadasa (Shyamananda Pandita) in the water, following which he was able to enter the pastimes of Srimati Radharani in a gopi form as Kanaka Manjari."
    },
    {
        "name": "Paurnamasi Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1034,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69506,
            "latitude": 27.58282
        },
        "imageName": "34. Paurnamasi devi",
        "description": "Just a few meters from the entrance to Seva-kunja is the temple of Paurnamasi devi, who is Yogamaya, the presiding Deity of the pastimes of Srimati Radharani and Lord Krsna in Sri Vrndavana-dhama. Srila Rupa Gosvami describes, “Full of transcendental opulences, Paurnamasi devi is the incarnation of the Lord’s Yogamaya potency. She makes the arrangements for Lord Krsna’s pastimes to be properly performed. She is slightly tall in stature and has a fair complexion. Her hair is the color of kasa flowers and she wears red garments. She is greatly respected by Nanda Maharaja and all the other residents of Vrajabhumi. She was the dear student of Devarsi Narada and on his advice she left her favorite son, Sandipani Muni, in Avantipura and came to Gokula, impelled by great love for her worshipable Lord Krsna.” (Radha-krishna-ganoddesa-dipika, 1.67-69)"
    },
    {
        "name": "Murari Gupta’s Gaura-Nitai Deities",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1035,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69541,
            "latitude": 27.58113
        },
        "imageName": "35. Murari Gupta Gaura-Nitai Deities",
        "description": "This temple is at the beginning of Loi Bazaar, at its intersection with the road from the Bankebihari Bazaar, and is immediately across the road from Bankhandi Mahadeva. Murari Gupta worshiped these Gaura-Nitai Deities in Mayapur. These Gaura-Nitai Deities reflect Murari Gupta’s connection with Lord Rama, as They are standing with Their hands in the mudras of Rama and Laksmana holding bows and arrows. He was an incarnation of Hanuman, and therefore had a very deep relationship with Lord Rama, the nature of which is explained in detail in the chapter of Caitanya-bhagavata dealing with the Mahaprakasa lila. The Deities were lost until about 200 years ago when devotees living where Murari Gupta had previously resided noticed that every day a cow would go to a particular place there and release her milk. When they dug at that spot, they found these Deities. Initially, a devotee named Balarama Pandita started to worship Them, but one day They were visited by a lady named Candrasasi Mukhopadhyaya, who became fascinated by Them, and following that would come and see Them every day. Once she prepared sweet rice for Them, and then that night They appeared to her in a dream and told her, “Give Us some more sweet rice. It was really nice!” The Deity of Lord Caitanya was pulling at her sari, and as He pulled, the edge of her cloth tore off. When she woke up, she found her sari had actually become torn, and that the Deity of Lord Caitanya had the piece of cloth in His hand. It was then that Candrasasi mataji took over Their worship."
    },
    {
        "name": "Bankhandi Mahadeva Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1036,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69550,
            "latitude": 27.58094
        },
        "imageName": "36. Bankhandi Mahadeva",
        "description": "This is a very old Siva linga situated at the crossroads of Loi Bazaar and the road heading towards the Bankebihari Bazaar. It is said that Srila Sanatana Gosvami while living in Vrndavana town at Dvadasaditya-tila, would daily walk from there to the Gopesvara Siva temple some kilometers away. This long walk became very difficult for Sanatana in his older age, so one night Gopesvara appeared in his dream and told him, “You don’t have to walk so far every day. I have now manifested myself closer to you in the form of Bankhandi Mahadeva.” From that time on, Sanatana would take his darsana at this place."
    },
    {
        "name": "Andhera-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1037,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.414084,
            "latitude": 27.350296
        },
        "imageName": "37. Andhera-ghata",
        "description": "This ghata is named after a nice pastime of Srimati Radharani and Lord Krsna that took place nearby. Once, Lord Krsna came here to let His cows drink the Yamuna’s waters. Radharani and the gopis arrived and began a game of hide and seek with Him. First, one of the gopis covered her eyes while Krsna, Srimati Radharani, and the others hid in the forest, and then the gopi had to locate them among the trees, which she managed to do quite quickly. Each of the gopis took a turn to be the one who had to find everyone else, until finally Krsna had a chance. Srimati Radharani covered His eyes and gave the gopis a minute to hide, and then Krsna began to search for them. However, even though He tried His best, searching high and low, still He was not able to find the gopis. At last, they emerged from their hiding places, laughing very sweetly. Because Srimati Radharani had covered Krsna’s eyes here, this place is known as Andhera-ghata, or the ghata of the blind person. Due to the ravages of time, this ghata is no longer present in a manifest form."
    },
    
    {
        "name": "Syamananda Tilaka Sthana and Samadhe",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1039,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69606,
            "latitude": 27.58344
        },
        "imageName": "39. Syamananda Tilaka Sthana and Samadhe",
        "description": "The place where Syamananda received his tilaka and the Syamasundara Deity. It is located across the road from the Syamasundara temple, and further down from the Salagrama temple, inside a small asrama. His puspa-samadhi is next to it."
    },
    {
        "name": "Srngara Vata or Nityananda Vata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1040,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69595,
            "latitude": 27.58459
        },
        "imageName": "40. Srngara Vata or Nityananda Vata",
        "description": "Once Srimati Radharani, in the company of Her gopi friends, was dressing and decorating Herself secretly underneath a banyan tree, preparing for a rendezvous with Krsna. Everyone was doing everything very quietly and discretely, making sure that Krsna would not know what was happening, so when They would meet Krsna would be pleasantly surprised by His beloved’s transcendental beauty. Little did Srimati Radharani, know, but all the while Her Syamasundara was watching everything from behind some of the nearby trees. At a suitable moment, He silently came up behind Her, indicating to the gopis not to let Her know He was approaching. Krsna then took over the service of one of the manjaris who, sitting behind Srimati Radharani, was decorating Her long plait of black hair hanging down Her back. He delicately braided it and decorated it, and Srimati Radharani was feeling extraordinary pleasure from the expert service of Her assistant. She started praising Her friend, “Oh, you’re doing this so nicely. I’ve never felt so much pleasure from being decorated like this before. I can’t wait till Krsna sees Me. I’m sure He’ll be very happy with Me!” At that moment, Srimati Radharani picked up a mirror to see how Her hair looked, and to Her surprise, She saw it was Her dear Prananatha doing the decorating. Krsna burst out laughing, and the other gopis joined in, and then Srimati Radharani also laughed and laughed. This place is therefore called Srngara Vata, the banyan tree under which Krsna decorated Srimati Radharani."
    },
    {
        "name": "Jaru Mandala",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1041,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69582,
            "latitude": 27.58491
        },
        "imageName": "41. The entrance  Jaru Mandala",
        "description": "Once Srimati Radharani, in the company of Her gopi friends, was dressing and decorating Herself secretly underneath a banyan tree, preparing for a rendezvous with Krsna. Everyone was doing everything very quietly and discretely, making sure that Krsna would not know what was happening, so when They would meet Krsna would be pleasantly surprised by His beloved’s transcendental beauty. Little did Srimati Radharani, know, but all the while Her Syamasundara was watching everything from behind some of the nearby trees. At a suitable moment, He silently came up behind Her, indicating to the gopis not to let Her know He was approaching. Krsna then took over the service of one of the manjaris who, sitting behind Srimati Radharani, was decorating Her long plait of black hair hanging down Her back. He delicately braided it and decorated it, and Srimati Radharani was feeling extraordinary pleasure from the expert service of Her assistant. She started praising Her friend, “Oh, you’re doing this so nicely. I’ve never felt so much pleasure from being decorated like this before. I can’t wait till Krsna sees Me. I’m sure He’ll be very happy with Me!” At that moment, Srimati Radharani picked up a mirror to see how Her hair looked, and to Her surprise, She saw it was Her dear Prananatha doing the decorating. Krsna burst out laughing, and the other gopis joined in, and then Srimati Radharani also laughed and laughed. This place is therefore called Srngara Vata, the banyan tree under which Krsna decorated Srimati Radharani."
    },
    {
        "name": "Mirabai Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1042,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69707,
            "latitude": 27.58411
        },
        "imageName": "42. The entrance to the Mirabai Temple",
        "description": "To get to this temple, you must go past the Radha-Damodara temple to sringara Vata, and turn right in front of It. If you follow this road, the Mirabai temple will be at the very end of it.\r\n Mirabai is a famous Saint of India, and she spent part of her life in Vrindavana. Born about 1500, the year in Chaukori in Rajasthan, like a Princess in a wealthy family. When she was three years old, a sadhu came to their house and gave her father the Deity of Krishna. He did not dare to give it to Meera because he was afraid that she would not be able to appreciate it, but when Meera saw Krsna, she insisted on receiving it, and began to cry and refuse to eat until it was given to Her. As time went on, her circumstances at home deteriorated, and after the death of her husband, she went to Sri Vrindavna-Dhama, and stopped at the place where the temple is now located. On the altar are the Radha - manohara, and to the left of the Deities (in relation to us) The deity of Mirabai singing kirtan. To the right of the altar is a small room where, according to legend, she lived.\r\n Srila Prahupada said that mirabai appreciated Lord Caitanya: \"She recognized that Lord Caitanya is Krsna, and even wrote one song:' Now You have given up your flute and accepted the sannyasi way.' She wrote beautiful poems. \"Where are Your hair and peacock feather? Now You are shaven.\" Thus, the World took It»aTo reach this temple you must walk past Radha - Damodara till you come to the road to Srngara Vata, and then directly opposite it turn right. If you walk along this road, you find the Mirabai temple on the right just before the end.\r\n\r\nMirabai is a famous female saint of India, and some of her life was spent in Vrndavana. She was born around 1500 in Chaukari in Rajasthan, as a princess in a royal family, and when she was three a sadhu visited the palace and gave her father a Deity of Krsna. He was reluctant to give it to Mira, as he was afraid she might not value it, but when Mira saw Krsna she insisted on having Him, and screamed and refused to eat until He was given to her. \r\n\r\nAs time went on things worsened for her at home, one day, after the death of her husband, she secretly left for Sri Vrndavana-dhama and settled at the place where this temple is today. On the altar are Radha-Manohara, and on our left side of Them is a Deity of Mirabai playing karatalas. To the right of the altar area is a small room that is said to have been her sitting place.\r\n\r\nSrila Prabhupada mentions that Mirabai appreciated Lord Caitanya, “She appreciated that Lord Caitanya is Krsna, and she has written one poetry, song, that ‘Now You have left aside Your flute, and You have taken the sannyasi rod.’ In that way, she has written nice poetry. ‘And where is Your hair and peacock feather? Now You are bald-headed.’ In this way. So Mira appreciated.”"
    },
    {
        "name": "Shahji Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1043,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69700,
            "latitude": 27.58474
        },
        "imageName": "43. The entrance to the Shahji Temple",
        "description": "This palatial temple was built in 1876 by a jeweler named Kundanlal from Lucknow who was connected with the Gosvami families from the Radha-Ramana temple situated a short distance away. His idea was that Radha-Ramana should come from His small temple to this magnificent palace where He could be more easily taken care of, and the whole ambiance would be more in keeping with His position as the Supreme Personality of Godhead. Radha-Ramana Himself, however, had other ideas and refused to come, so other Deities were installed. \r\nThe present Deities are known as “Chota Radha-Ramana,” or “Small Radha-Ramana.”\r\n\r\nIn front of the temple are twelve four-meter tall pillars of carved marble, each made from a single piece of stone. Inside there is the temple room and another special room known as the “Vasanti Kamra” or the “Spring Room” where the Deities stay for two days a year around the time of Vasant Pancami, the day of the lunar calendar on which spring officially starts. In this room, there is an outstanding collection of old Belgian chandeliers and ornamental light fixtures which are lit up for the pleasure of the Deities only on these two days in the year. It is quite a spectacle, and thousands of people come from all over Vraja to have this special darsana."
    },
    {
        "name": "Govinda-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1044,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.414829,
            "latitude": 27.350882
        },
        "imageName": "44. Govinda-ghata",
        "description": "It is said that once during the rasa dance, Srimati Radharani saw Krsna dancing with all the gopis and became a little transcendentally jealous. She then left the dance and came to this place in Her mood of mana, or spiritual anger. Krsna found Her here and pleased Her with His sweet dealings. Therefore this ghata is known as Govinda-ghata, or the place where the Lord satisfied His beloved.\r\n\r\nOn the left-hand side of the ghata is an old, seldom-visited red sandstone temple in which there are beautiful Deities of Krsna and Balarama. Krsna is on our left playing the flute, and Balarama is on our right churning some yogurt into butter. Behind Them are standing large Deities of Their parents, Nanda Maharaja and Mother Yasoda."
    },
    {
        "name": "Sadbhuja Mahaprabhu Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1045,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69810,
            "latitude": 27.58573
        },
        "imageName": "45. The entrance to the Sadbhuja Mahaprabhu Temple",
        "description": "Sadbhuja Mahaprabhu is Lord Caitanya manifesting His features as Lord Krsna and Lord Ramacandra. Therefore the Deity on the altar here is of Mahaprabhu with His own two arms holding His sannyasa danda and kamandulu (water pot), the two arms of Krsna holding His flute, and the two arms of Lord Rama holding His bow and arrow.\r\n\r\nThis Deity was personally worshipped by Srila Jagannatha dasa Babaji Maharaja, who is in our Gaudiya Vaisnava parampara before Srila Bhaktivinoda Thakura. He had previously been worshiping Gaura-Nitai Deities named Sona Gauranga, or Golden Gauranga, but They were later given to one of the Gosvami families in Vrndavana. \r\n\r\nAfter some time, Jagannatha dasa felt he needed some new Deities to worship, and he sent his disciple, Bihari dasa, to Radha-kunda to acquire a new set. While there, Bihari dasa and his friend, Dhenu dasa Babaji, are said to have found Sadbhuja Mahaprabhu in a haystack. They brought Him to Jagannatha dasa Babaji, who was then living in Surya-kunda, between Govardhana and Chata. \r\n\r\nHe worshiped Him there for about ten years, and later on, when he moved to Bengal, He was given to Narottama dasa Babaji, the contemporary leader of the Gopala Guru Gosvami line, and He is being worshiped in his temple in Vrndavana town to this day."
    },
    {
        "name": "Vamsi Gopala Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1046,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69827,
            "latitude": 27.58629
        },
        "imageName": "46. The entrance to the Vamsi Gopala Temple",
        "description": "Srila Prabhupada stayed in this temple from time to time between 1956 and 1962 in a room on the second floor overlooking the courtyard. It is a privately-owned building, and his rooms are now rented out to other people, so it is not possible to have darsana of them, although one can go into the temple room and see the Deities. \r\n\r\nThe temple is situated about 75 meters from the Radha-Gokulananda temple on the left side of the road as it turns to the right heading towards the Yamuna."
    },
    {
        "name": "Yugala Kisora Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1047,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69869,
            "latitude": 27.58694
        },
        "imageName": "47. Yugala Kisora Temple",
        "description": "The Muslim Emperor Akbar visited Vrndavana in 1570 and gave permission for four temples to be constructed there—Madana-Mohana, Govindadeva, Gopinatha, and Yugala Kisora. \r\n\r\nThe Yugala Kiçora temple was completed in 1627, but then in 1670 when Aurangzeb attacked it was defaced by the Muslim soldiers, and there has been no formal worship here ever since. It is a large, classical-looking temple on the left past the Gadadhara Dant Samadhi just before you reach the Yamuna."
    },
    {
        "name": "Cira-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1048,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69664,
            "latitude": 27.58547
        },
        "imageName": "48. Cira-ghata",
        "description": "This spot is said by some to be where Lord Krsna stole the gopis’ clothes when they were finishing their monthlong Katyayani vow, as described in Srimad Bhagavatam Tenth Canto, Chapter 22. It is, however, more generally accepted that this pastime took place further up the Yamuna, where there is a famous Deity of Katyayani devi at a place with the same name.\r\n\r\nLord Krsna rested here after killing the Kesi demon at Kesi-ghata, which is very close by."
    },
    
    {
        "name": "Kesi-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1050,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69875,
            "latitude": 27.58723
        },
        "imageName": "50. Kesi-ghata from Yamuna",
        "description": "The Yamuna River runs right past Kesi-ghata. This is where Lord Krsna killed the Kesi demon, who came in the form of a horse.\r\n\r\nSrila Bhaktivinoda Thakura says that Kesi represents a type of superiority complex that may develop in the heart of a devotee as they make a little progress in devotional service. It may lead to disrespecting the Deities, guru, and then even bring one to the point of fall-down."
    },
    
    {
        "name": "Sriji Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1052,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69832,
            "latitude": 27.58228
        },
        "imageName": "52. Sriji Temple",
        "description": "The Sriji temple is one of the major Nimbarka temples in Vrndavana. It is a large, spacious building with friendly, helpful pujaris, situated about one hundred meters to the right from the eastern end of Loi Bazaar, on the left hand side of the road. It was opened by the Queen of Jaipur in 1823, and the main Deities are Radha-Anandamanohara and, on the other altars Radha-Vrndavana-candra and Hamsa Gopala. In the temple, there is a substantial library of old Sanskrit and Hindi literatures as well."
    },
    {
        "name": "Sona Gauranga Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1053,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69937,
            "latitude": 27.58508
        },
        "imageName": "53. Sona Gauranga Temple",
        "description": "Sona Gauranga means “Golden Gauranga.” These Deities were worshiped by Srila Jagannatha dasa Babaji Maharaja, and are now situated in a temple on the right hand side of the road running immediately opposite the entrance of the Radha-Gopinatha temple, about 250 meters down the road.\r\n\r\nWhen Jagannatha dasa was living at Surya-kunda, he requested his disciple Bihari dasa to install some Deities, and these beautiful brass Gaura-Nitai Deities were made. They glistened like gold, and as news of Their beauty spread around the district, some dacoits decided to steal and sell Them, thinking They were actually made of gold. They broke into the temple one night and tried to take the Deities away, but were unable to lift Them, so, fearing detection, they fled. The next morning Jagannatha dasa found out what had happened and became extremely disturbed about the risks of keeping such Deities, so he then arranged for Bihari to donate Them to a Gosvami family in Vrndavana town. They are still at that location today."
    },
    {
        "name": "Amiya Nimai Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1054,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70009,
            "latitude": 27.58319
        },
        "imageName": "54. Amiya Nimai Temple",
        "description": "This very large Deity of Lord Caitanya was first worshiped in Bengal many years ago, and around the end of the 19 th century, He came into the care of a devotee in the line of Gopala Bhatta Gosvami, Sarvabhauma Madhusudana Gosvami. Sarvabhauma was a member of one of the Gosvami families of the Radha-Ramana temple in Vrndavana. One of his disciples in Calcutta, Radha-Govinda Gosvami, installed the Deity in Calcutta. Radha-Govinda Gosvami had no children and, in his later age, wondered who would continue the service of Amiya Nimai, as the Deity had come to be known. Amiya Nimai came to the Gosvami in a dream and told him to contact Krsna Caitanya Gosvami of the Radha-Ramana temple and get him to take Him to Vrndavana.\r\n\r\nFollowing the dream, Radha-Govinda Gosvami and Krsna Caitanya Gosvami discussed the matter for some time in a series of letters without reaching a conclusion, and shortly afterward, Radha-Govinda Gosvami passed away. Krsna Caitanya Gosvami arranged in 1936 that Amiya Nimai be transported from Calcutta to Vrndavana, where He was installed in a room by the rasa-mandala outside the main entrance to the Radha-Ramana temple. The worship went on there for some time, and then in 1954 Krsna Caitanya Gosvami obtained land in the Gopinatha Bazaar area of Vrndavana town, and Amiya Nimai’s new temple was opened there in 1956.\r\n\r\nHe is a magnificent Deity and is worshiped very nicely, still under the care of the devotees of Radha-Ramana temple."
    },
    
    {
        "name": "Govinda-kunda",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1056,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69939,
            "latitude": 27.57420
        },
        "imageName": "56. Govinda-kunda",
        "description": "This is the biggest kunda in Vrndavana town, although at present it is in a neglected condition. Srila Visvanatha Cakravarti Thakura’s Vraja-riti-cintamani says:“Far to the south (of the Govindaji temple) is Govinda-kunda, the lake of Lord Govinda, the husband of the goddess of fortune. Around this lake are many groves filled with buzzing bees.” (Vraja-riti-cintamani, 2.72)"
    },
    {
        "name": "The Sixty-Four Samadhis Garden",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1057,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70210,
            "latitude": 27.58064
        },
        "imageName": "57. The 64 Samadhis Garden",
        "description": "This is another very peaceful place in Vrndavana, sanctified by the presence of the puspa-samadhis and nama-samadhis (memorials which feature the names of saintly persons) of at least 64 of the main associates of Lord Caitanya and Lord Nityananda. There are more than 64 samadhis here, but that particular number comes from the fact that there are samadhis of the 64 mahantas, or 64 of Lord Caitanya’s most confidential companions here. Near the entrance, there are nama-samadhis of Lord Caitanya and Lord Nityananda, and throughout the garden, the presence of great saintly personalities is quite overwhelmingly felt."
    },
    {
        "name": "Ranganatha Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1058,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70280,
            "latitude": 27.58203
        },
        "imageName": "58. Ranganatha Temple",
        "description": "Ranganatha temple is the biggest temple in Vrndavana, and it is in a typical South Indian style, completely different from all the other temples in Vraja. It is a Sri Vaisnava temple, and here one finds the Lord being worshiped in His form as Ranganatha, Lord Visnu in the company of His internal energies Sri and Bhu. Seeing the Lord in this form distinguishes this temple from practically every other temple in Vrndavana, in which one finds Radha and Krsna being worshiped. The mood here reflects the difference in Deity. One feels a Vaikuntha atmosphere."
    },
    {
        "name": "Brahma-kunda",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1059,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70139,
            "latitude": 27.58338
        },
        "imageName": "59. Brahma-kunda",
        "description": "Here the brahma-vimohana-lila took place, in which Lord Brahma stole Krsna’s cowherd boyfriends and calves, as described in the 13 th and 14 th Chapters of the Tenth Canto of Srimad-Bhagavatam. \r\n\r\nThere it is described how Lord Brahma had been watching how the inhabitants of Vrndavana were glorifying and worshiping Krsna and he became envious to the point of losing sight of the fact that Krsna is his worshipable Lord, just as He is for the Vrajavasis."
    },
    {
        "name": "Lal Babu Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1060,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70327,
            "latitude": 27.58361
        },
        "imageName": "60. Lal Babu Temple",
        "description": "Lal Babu is mentioned by Srila Prabhupada in his Nectar of Devotion when he discusses the quality of pridelessness as a characteristic of one in ecstatic love: “Even very recently, about two hundred years ago or less, one big landlord known as Lal Babu, a Calcutta landholder, became a Vaisnava and lived in Vrndavana. \r\n\r\nHe was also begging from door to door, even at the homes of his political enemies. Begging involves being ready to be insulted by persons to whose home one has come. That is natural. But one has to tolerate such insults for the sake of Krsna. The devotee of Krsna can accept any position in the service of Krsna.” (Nectar of Devotion, Chapter 18)\r\n\r\nThis is a fairly substantial temple, set in a nice walled garden, with big Radha Krsnacandra Deities."
    },
    {
        "name": "Radha Gopala Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1061,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70248,
            "latitude": 27.58455
        },
        "imageName": "61. Radha Gopala Temple",
        "description": "This large temple is situated between the Lal Babu Temple and the Gopesvara Temple. It was built in 1860 by members of the Scindia family."
    },
    {
        "name": "Gopesvara Mahadeva Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1062,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70296,
            "latitude": 27.58514
        },
        "imageName": "62. Gopesvara Mahadeva Temple",
        "description": "This is one of the original five-thousand-year-old Deities of Vrndavana, installed by Lord Krsna’s great grandson, Vajranabha. Sometimes it is said that in Vrndavana there are five particularly merciful persons who may give the devotees special access to love for the Lord. One is Govardhana Hill, another is Vrnda devi, another is the River Yamuna and the fourth is the dust of Vrndavana, The fifth is Gopesvara. He is a very special person.\r\n\r\nHe is Lord Siva in a female form as a gopi connected with Lord Krsna’s rasa dance.\r\nThis is one of the original Deities of Vrndavana, established five thousand years ago by the great-grandson of Lord Krsna, Vajranabha. It is said that there are five particularly merciful persons in Vrndavana who can reveal the love of God to the devotees in a special way. One person is Govardhan hill, another is Vrinda Devi, a third is the Yamuna river, and a fourth is the dust of Vrindavan. The fifth person Gopeswar, very special person.This is Lord Shiva in the form of a gopi associated with the Rasa dance of Lord Krishna."
    },
    {
        "name": "Vamsivata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1063,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70352,
            "latitude": 27.58622
        },
        "imageName": "63. Vamsivata",
        "description": "Vamsivata, there is a Deity of Gopesvara in one corner of the temple compound, and in another corner is a Deity of Asuri Muni, who is chanting japa happily while watching the rasa dance. To the left of the main temple is a small temple dedicated to Annapurna devi, who is actually Paurnamasi. \r\n\r\nSrimad-Bhagavatam describes that on the full moon night of the sarat season (autumn), Lord Krsna stood under the banyan tree that was here and played His celebrated flute, calling the gopis to come and join Him for the rasa dance, the sweetest of all His transcendental pastimes. “Vamsi” means flute, and “vata” means banyan tree, so the word Vamsivata refers to that banyan tree under which the Lord played His flute that night. \r\n\r\nCaitanya-caritamrta describes that when Lord Caitanya visited here He saw the original tree, but then shortly after that the tree was washed away when the Yamuna flooded one time. Luckily, however, the devotees found the tree washed up on the side of the river the next day, still partially alive, and took a branch from it which they planted here, and the current tree has grown from that. Therefore, in one sense, the tree we see here today is still the original tree from five thousand years ago."
    },
    {
        "name": "Radhakanta Temple of Gopala Guru Gosvame",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1064,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70245,
            "latitude": 27.58587
        },
        "imageName": "64. Radhakanta Temple of Gopala Guru Gosvami",
        "description": "Gopal Guru Gosvami was a disciple of Vakreshvara Pandita, a close associate of Lord Caitanya. He was born near Jagannatha Puri in Orissa, and from his childhood became deeply attached to the Lord and his associates. There is a famous story about how he received the title \"Guru\" from Lord Caitanya. The Lord was on the way to the bathroom and five-year-old Gopaal saw Him holding his tongue beetween his fingers as He proceeded down to the path. Gopala asked Him, \"My Lord, why are You holding your tongue?». Lord Caitanya replied, \" Gopala, I am on my way to the bathroom, which is a very dirty place. But the Holy name of Lord Krsna is non-different from Him, so if I chant in the bathroom, He will be exposed to all the nastiness there. If I could, I would simply stop chanting, but the problem is that I can't stop no matter how hard I try, and therefore I am holding My tongue to avoid making that offense\".Gopala replied: \"Please don't worry, my Lord. The time of death is the most contaminated time of all even worse than when we are in the bathroom, but sastras say that at the time of death, we must chant the Holy names of the Lord. So it is all right for you to chant in the bathroom”. \r\nLord Caitanya was astonished and said: \"Thank you so much, Gopala! You've convinced me! From today on, you are my guru». From that time, Gopal became known as Gopal Guru, and later, when he took sannyasa, he became known as Gopala Guru Gosvami. \r\nThe Deities in the Radhakanta temple in Vrindavana are pratibhu forms of the original Deities in Puri. On the right side of the temple courtyard is the Deity of Gopala Guru, and to the left of this Deity is the tree that he is said to have been sitting under and chanting, when his followers found him."
    },
    {
        "name": "Srenivasa Asarya’s Samadhi",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1065,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70211,
            "latitude": 27.58585
        },
        "imageName": "65. Srinivasa Acarya's Samadhi",
        "description": "Srinivasa Acarya is the leader of the next generation of Gaudiya Vaishnavas after the six Gosvamis, along with Narottama das Thakur and Shyamananda Pandita. On the altar in this temple, in the center of lower level, is his small Deity of Krishna known as Jula Thakura, which means \"the Lord who stays in a bead bag (jula)\". Srinivasa would move around Vrndavana with this Deity in a bag around his neck andas he chaned japa He would massaged Him. Across the courtyard from the altar is a small room in which is his samadhi, as well as the samadhis of his most prominent disciple, Ramachandra Kaviraja, and his daughter Hemalata, who was also a great preacher of Krishna consciousness."
    },
    {
        "name": "Radha-Syamarya Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1066,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.421010,
            "latitude": 27.351005
        },
        "imageName": "66. Radha-Syamaraya Temple",
        "description": "This temple was built by Gauridas Pandit, one of the closest associates of Lord Caitanya, who worshipped Radha-Syamasundara, the Deities on the main altar. He was the uncle of Lord Nityananda's two wives, Jahnavi and Vasudha, and spent many games with Lord Caitanya while he was living at Ambika Kalna in Gaura Mandal, in West Bengal. It seems that he lived most of his life in Bengal. His complete Samadhi is located in the center of the courtyard of this temple. One day, Lord Caitanya went to see Gauridasa at Ambika Kalna, after crossing the Ganges in a boat from Shantipur. He told the Pandit: \"I went to Shantipur, from there I sailed on the boat to the village Haryadi. I crossed the Ganges in a rowboat. This is the paddle you take it. I give it to you. With this paddle, humanity can cross the ocean of this material world.\" Having said this, the Lord embraced Gauridasa Pandita. Sri Caitanya Mahaprabhu personally told Gauridas to carve the Deities of himself and Lord Nityananda out of the neem tree, which He did. He worshipped Them day and night, chanting the Holy names of the Lord, and the Deities communicated with him every day. One day he prepared a great feast for Gaura-Nitai and placed it on the altar before Them, but They were silent. In anger Gauridas said to the Deities: \"If You are satisfied without food, why do You force me to cook for You? \" the Gaura-Nitai replied,\"Gauridas, you are never satisfied with cooking a small amount of food. You always want to cook a lot. When We ask you not to cook so much, you never listen. It hurts Us to see how hard you work just to make Us dinner. Remember, the most pleasant offering for Us will be something that will be easy for you to prepare.\" Gauridas replied: \"I will never do it again! From this moment on, I will only offer You boiled rice and spinach!» The two gentlemen laughed and began to eat what he had prepared for Them. \"You have so much devotion that whatever you prepare will satisfy Us very much,\" said Lord Nityananda."
    },
    {
        "name": "Dhira Samira-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1067,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70245,
            "latitude": 27.58676
        },
        "imageName": "67. Dhira Samira-ghata",
        "description": "The surroundings of the Shyamsundara temple are called Dhira Samira-Ghat, which means \"Ghat for bathing with a very pleasant, gentle breeze\". There were once beautiful gardens overlooking the river where Radha and Krsna enjoyed transcendental pastimes, although over the course of time, they have been lost to external vision."
    },
    {
        "name": "Yugala-Kisora Temple (Mirror Mandir)",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1068,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.69869,
            "latitude": 27.58693
        },
        "imageName": "68. Yugala-Kisora Temple",
        "description": "This temple has its walls and ceiling covered in Belgian mirrors, so it is quite spectacular to behold and for this reason it is also known as Kanch Mandir (Mirror temple). The Deities are very beautiful Deities and there is a Deity of baby Krishna in a swinging cradle in front of the main altar. To the right is a Radha Nama Bank, where pilgrims are encouraged to write the name of Srimati Radharani as many times as possible. The current sevaite, Laldi Goswami is a Gaudiya Vaishnava, the 27th generation descendant of Hari Rama Vyasa.\r\n\r\nHari Rama Vyasa came to Sri Vrindavana-Dhama in the 15th century from the area in Madhya Pradesh known as Orsha, where he was the head priest in the Bundle Kunda kingdom. When he arrived, he first performed austerities in Kishori-Kunja, next to Seva-Kunja, until the day when he discovered the Deities we see on the altar here. He named them Yugala-Kishora. Later, when the Muslims attacked, the Deities were brought across to the part of Vrindavana town They are in now, which is called Vyasa Ghera. Their first Temple was constructed here by Maharaja Virasingh in the 16th century. \r\nIn 1940, then the king of Madhya Pradesha bought the mirrors and glass that is in the temple now, from Belgium, and had it installed on the walls and ceilings of the temple."
    },
    {
        "name": "Jnana Gudri",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1069,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70522,
            "latitude": 27.58396
        },
        "imageName": "69. Jnana  Gudri",
        "description": "It is now in the form of a one acre open park. Gudri is a transformation of the original words of gudadi, which means a bundle of rags. It is said that when Uddhava came to Vrndavana to give the inhabitans different messages from Krsna, he imparted some of the letters here. Krsna was trying to pacify the Vrajavasis by telling them that He is present everywhere, so there is no need to worry about that He has gone to Mathura, but rather they can always be with Him on the spiritual platform through remembering Him. Some of the Vrajavasis took it that Krsna was trying to preach jnana to them and somehow cheat them of His personal association, so they tore the letters, which were written on cloth inti rags and threw them into the Yamuna here. Therefore, this place is known traditionally as Jnana Gudadi, the place where the Jnana was torn into rags. It is also said that Uddhava informed Vidura here of the final instructions Lord Krsna had left for him just before He left this world. This is described in the beginning of the Third Canto of Srimad-Bhagavatam."
    },
    {
        "name": "Radha-Braja-mohana Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1070,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70543,
            "latitude": 27.58356
        },
        "imageName": "70. Radha-Braja-mohana Temple",
        "description": "The main Deities on the altar here, Radha-Braja-mohana, were installed by Narottama dasa Thakura during the first Gaura Purnima festival which was held in Kheturi (in current-day Bangladesh) approximately 30 years after the disappearance of Lord Caitanya Mahaprabhu."
    },
    {
        "name": "Tekari Rani Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1071,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70635,
            "latitude": 27.58382
        },
        "imageName": "71. Tekari Rani Temple",
        "description": "This large, attractively-built temple established in about 1870 by the Queen of Tikari, a city near Gaya in Bihar. When she came on pilgrimage to Vrindavana, her party was attacked by Muslim dacoits on the eastern side of Yamuna. She was forced to flee from them with her Deity Gopala, and swam across the Yamuna, which at that time was flowing right where the front door of the temple is now. When she came safely to the western side of the Yamuna, the queen vowed to build a temple right at the place where she had landed, and this is the temple we see today."
    },
    {
        "name": "Sudama Kuti",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1072,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.422407,
            "latitude": 27.350298
        },
        "imageName": "72. Sudama Kuti",
        "description": "This is a temple of the Ramanandi Vaishnavas, founded by a devotee in their line named Sudama. Here they do substancial prasadam distribution. On the altar are the beautiful Deities of Sita, Rama, Lakshmana and Hanumana."
    },
    {
        "name": "Tulasi Rama Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1073,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70607,
            "latitude": 27.58269
        },
        "imageName": "73. Deity of Lord Rama at the Tulasi Rama Temple",
        "description": "The Tulasi Rama temple is connected with the famous north Indian devotee, Tulasi dasa, who lived from about 1532 to 1623, just shortly after the time of Lord Caitanya. He was a Rama bhakta and compiled a version of the Ramayana in Hindi, known as the Rama-carita-manas, which has become a classic in this part of the country, to the point of even being more popular than Valmiki Ramayana. There are small Radha - Krsna Deities here, as the temple was previously dedicated to Them, but when Tulasi dasa visited here one time He came before Deities and said to Them: \"Your heavenly beauty is overwhelming, Lord Krsna! However, this Tulasi dasa will not bow to You unless he sees You take the bow and arrows in Your hands!». It is said that then Lord Ramacandra appeared before him. After that, the devotees here installed a large Deity of Rama, Who is still standing behind Radha and Krishna."
    },
    {
        "name": "Jagannatha-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1074,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.422638,
            "latitude": 27.350361
        },
        "imageName": "74. The entrance to the Jagannatha-ghata Temple",
        "description": "Around the year 1785 or so, there was a Ramanandi Vaisnava named Haridasa who stayed here meditating on Lord Krsna. Every day he would chant Hare Krsna in a dependent mood, and it is said that once the Lord appeared to him as a five-year-old child and instructed him to go to Jagannatha Puri and bring Jagannatha, Baladeva and Subhadra devi here to Vrindavan, and to worship Them at this place.\r\n\r\nAccording to the story, Haridasa traveled there as ordered, and asked the pandas if when they change the Jagannatha Deities the next, he could take the old Deities to Vrindavana rather than have buried in the ground, which is a normal procedure when the Deities are changed. The pandas refused, but the Lord appeared in the dream to the King of Puri, and confirmed that this was actually what He wanted so shortly after, when the Deities were changed, the old ones were brought here. \r\nIf this story is accurate, then these very Deities were previously on the altar in the great temple in Puri."
    },
    {
        "name": "Katyayani Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1075,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70375,
            "latitude": 27.57887
        },
        "imageName": "75. Katyayani Temple",
        "description": "The Katyayani temple is a general Hindu temple, not connected with the Vaishnava history and culture of Sri Vrindavana-dhama, but despite that fact, it is quite popular. Here they performed pancopasana, or worship of the five Deities, Durga (Katyayani), Siva, Visnu, Ganesa and Surya, as is, typical for many people who follow the impersonal tradition. It was opened in 1923, and is very much in the mode of the worship of Durga devi."
    },
    {
        "name": "Rangaji Gardens",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1076,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70349,
            "latitude": 27.57734
        },
        "imageName": "76. Rangaji Gardens",
        "description": "For anyone looking for a quiet and beautiful place to relax and chant japa in Vrindavana, this is the ideal spot. It is a large garden and is fairly well maintained, and one can easily find quiet places to sit and chant the Holy names without being disturbed."
    },
    {
        "name": "Pani-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1077,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70776,
            "latitude": 27.57788
        },
        "imageName": "77. Pani-ghata",
        "description": "The Gopala-tapani Upanishad describes a pastime that happened here: Once, after they had passed the night in conjugal pastimes with Him, the passionate girls of Vraja asked Krishna: \"To what brahmana should charity be given?» Krishna replied: \"To Durvasa\". The sage Durvasa was living on the other side of the Yamuna, so the gopis asked: \"How will we cross the Yamuna’s waters and approach him, from whom great blessings will come?» Krishna said: \"Just say the words: \"Krsna is the topmost brahmachari,\" and the Yamuna will give you a path. By remembering Me, a shallow person becomes deep. By remembering Me, an impure person becomes pure. By remembering Me, an impious person becomes pious. By remembering Me, one full material desires becomes desireless. By remembering Me, a fool becomes learned.\" \r\n\r\nAfter hearing this, the gopis, anxious to get the mercy of Durvasa, repeated Krsna’s words, and to their surprise the waters of the Yamuna parted and allowed them to cross. They went to the sacred ashrama and bowed down before Durvasa Muni, the best of sages, and gave him delicious foods made with milk and ghee. Pleased with them, he took bath, ate the prasadam they had offered, blessed them, and then gave them permission to return home. But the gopis became disturbed: \"How will we cross the Yamuna?» they asked. Durvasa replied: \"Just meditate on me as a sage who eats only durva grass, and the Yamuna will give you a path.\" \r\nSrimati Radharani reflected for a moment and then asked him, \"We know Krsna very well. He always pursues us for amorous pastimes. How can anyone say He’s a brahmacari? And we just saw you eat a big feast. How could anyone say you eat only durva grass?” When she placed these questions before Durvasa Muni, the other girls became silent. \r\nDurvasa answered their second question, regarding himself first, \"Sound is contained within the element ether, although sound and ether are different. The ether does not know this. And I am spirit. How can I be a materialistic enjoyer? Touch is contained within the element air, although touch and air are different. The air doesn't know this. I am a spirit. How can I be a materialistic enjoyer? Form is contained within the element fire, although - form and fire are different. Fire doesn't know this. And I am a spirit."
    },
    
    
    {
        "name": "Caitanya Visrama Sthali",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1080,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.70030,
            "latitude": 27.56740
        },
        "imageName": "80. Caitanya Visrama Sthali",
        "description": "This place is across the road from Raja-ghata and a few meters further down the parikrama path. Lord Caitanya would stop here and chant Hare Krsna sometimes sitting under a banyan tree. The same tree is still there, and under it is the Deity of Lord Caitanya chanting."
    },
    {
        "name": "Batharan Bihari Temple",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1081,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68802,
            "latitude": 27.55658
        },
        "imageName": "81. Batharan Bihari Temple",
        "description": "This is where Lord Krsna ate after the pastime of delivering the wives of the brahmanas took place. In \"Srimad-Bhagavatam\" it is explained that following the pastime of the stealing of the clothes of the gopis, Krisna’s cowherd boyfriends were feeling very hungry as due to the excitement of that pastimes, they have forgotten to eat lunch. They therefore appealed to Krsna to help them satisfy their hunger. He directed them to approach some brahmanas who were performing an animal sacrifice nearby and request in His and Balarama’s names to give some food. The boys went and very humbly presented their please to the brahmanas, but they arrogantly ignored the boys, who then ran back to Lord Krsna. \r\nKrsna told the boys to approach the wives of the same brahmanas and ask them,as they were His devotees. The boys went and requested the ladies to give food as Krishna was nearby and was very hungry. The chaste ladies immediately gathered all different types of nice food, and despite the objections of their husbands, came to meet Krsna here on the banks of the River Yamuna."
    },
    {
        "name": "Akrura-ghata",
        "category": "Featured",
        "city": "Vrindavan",
        "state": "California",
        "id": 1082,
        "park": "Joshua Tree National Park",
        "coordinates": {
            "longitude": 77.68505,
            "latitude": 27.55178
        },
        "imageName": "82. Akrura-ghata",
        "description": "“Srimad-Bhagavatam” describes that when Akrura took Lord Krsna and Balarama out of Vrndavana to Mathura, they stopped here on the way, to take bath. First Krsna and Balarama bathed, and then, when They returned to sit in the chariot, Akrura took permission from Them to take bath. He was standing half-submerged in the Yamuna, chanting gayatri, when he suddenly saw Krishna and Balarama in the water again. Surprised, he came out of the water, but then saw that They were still seated in the chariot, and he thought he must have been mistaken when he thought he saw Them in the water. He went back into the river, but saw Them there again, and this time not alone, but surrounded by all sort of great personalities, including many of the demigods, and a great number of Siddhas, Caranas, and Gandharvas, all of whom were bowing down before Krsna and Balarama. \r\n\r\nLord Sesanaga was also there, dressed in blue clothes, His white necks appearing just like snow-capped mountains. Akrura saw Krsna lying on Ananta Sesa in a four-armed form, looking astonishingly beautiful. Seeing this Akrura was overwhelmed, and he offered beautiful prayer to the Lord, but then suddenly while he was still glorifying Him, the vision disappeared. \r\nWhen Lord Caitanya visited Vrndavana, he stayed here some of the time, spending the nights here and during the day going out to visit different holy places. He once became absorbed here in remembrance of Akrura meditating in the water and seeing Krsna there, and jumped in, staying under water for some time, until his assistant, Balabhadra Bhattacharya, with great difficulty manage to pull Him out. As a result of this incident, Balabhadra Bhattacharya felt forced to take Lord Caitanya out of Vrndavana, and the Lord, even though He did not really want to go, agreed to leave. \r\nIn those days, the Yamuna ran right past where the current temple is located, but now the river has moved some distance away. In the the temple are very nice Deities of Krishna and Balarama with Akrura between Them."
    },
   
]
